//! Завдання 2

//? У вас є тип AllType . Існує функція compare, яка вимагає двох об'єктів.
//? Ці об'єкти складаються з поля AllType. Ваше завдання – використовувати Pick
//? і генерики для вказівки, що поля цих параметрів належать AllType .
//? Функція compare повинна повернути AllType .

// type AllType = {
//   name : string ;
//   позиція : номер ;
//   колір: рядок ;
//   вага: кількість
// }

// функція порівняння (зверху, знизу): AllType {
//    return {
//     name : top .name ,
//     колір: top.color,
//    позиція : нижня .позиція ,
//     вага: bottom.weight,
//   }
// }
