//! Завдання 4

//? Ви маєте форму реєстрації користувача.
//? Іноді потрібно заповнити форму даними користувача для оновлення його профілю.
//? Однак вам не завжди потрібно заповнити всі поля. Наприклад,
//? користувач може хотіти оновити лише свою електронну адресу та пароль,
//? залишивши ім'я та ще ім'я без змін.

//? Використовуючи утиліту Partialта генерики, виправте тип параметра функції так, щоб уникнути помилок типізації.

// type User = {
//   ім'я: рядок ;
//   прізвище: рядок ;
//   email: рядок ;
//   пароль: рядок ;
// }

// function  createOrUpdateUser ( initialValues: User ) {
//    // Оновлення користувача
// }

// createOrUpdateUser ({
//    електронна пошта : 'user@mail.com' ,
//    пароль : 'password123'
// });
