//! Завдання 5

//? У вас є перелік UserRole , який використовується для класифікації користувачів
//?  у вашій додатку. Ви хочете створити об’єкт RoleDescription , який розмістить кожну роль користувача з її описом.

// експорт  enum UserRole {
//   admin = 'адміністратор' ,
//   editor = 'редактор' ,
//   guest = 'guest' ,
// }

// // Замініть наступний код на версії за допомогою Record
// const RoleDescription = {
//   admin: 'Користувач адміністратора' ,
//   редактор: 'Користувач редактора' ,
//   guest: 'Гість користувача' ,
// };
