//! Завдання 6

//? У вас є тип Form , який містить інформацію про форму, включаючи поле помилок.
//? Ви створите новий тип Params , який включає всі поля з Form , крім помилок .

// type  Errors  = {
//   електронна пошта ? :  рядок [];
//   Ім'я ? :  рядок [];
//   прізвище ? :  рядок [];
//   телефон ? :  рядок [];
// };

// type  Form  = {
//   електронна пошта :  рядок  |  null ;
//   firstName :  рядок  |  null ;
//   прізвище :  рядок  |  null ;
//   телефон :  рядок  |  null ;
//   errors : Помилки;
// };

// // Реалізуйте Params так,
// // щоб унеможливити поле 'errors' з типом Form
// type  Params  = Form;
